# Описание задачи:
# Необходимо разработать функции для работы со списком строк.

# Функция 1:
# Принимает список строк и строку, и выполняет вставку строки в середину списка.
# Если длина списка нечетная, то строка вставляется перед серединным элементом.
# Пример:
# Входные данные: ['a', 'b', 'c'], 'x'
# Выходные данные: ['a', 'x', 'b', 'c']

# Функция 2:
# Принимает список строк, число и строку, и выполняет вставку строки в указанную позицию.
# Если вставка на указанную позицию невозможна, возвращается сообщение "operation is not possible".
# Пример:
# Входные данные: ['a', 'b', 'c'], 2, 'x'
# Выходные данные: ['a', 'b', 'x', 'c']
